{
  "doc-893a7ec9ea15994da5f9bc7b1307b76e": {
    "content": "--- Page 1 ---\n\n111 ВАРИАНТ РЕШЕНИЯ ПРОБЛЕМЫ НЕОПРЕДЕЛЕННОСТИ В МОДЕЛЯХ ТИПА ТЕЙЛОРА – БИШОПА – ХИЛЛА С ПОМОЩЬЮ ИТЕРАЦИОННОГО ПОДХОДА П.А. Гладких Пермский национальный исследовательский политехнический университет, г. Пермь, Российская Федерация, gladkikh .p@yandex .ru Рассматривается проблема неопределенности выбора активных си- стем и вычислении скоростей сдвигов по системам скольжения в моде- лях типа Тейлора – Бишопа – Хилла, описаны часто применяемые для исключения данной неопределенности подходы. Предлагается новый итерационный подход для исключения неопределенности и некоторые результаты его проверки для частного случая. Ключевые слова: конститутивные модели, физически -ориенти- рованные модели типа Тейлора – Бишопа –Хилла, упругопластическая модель Линя, влияние неопределенности выбора активных систем скольжения. Большинство деталей из сплавов производятся с помощью термомеха- нических методов обработки. В зависимости от способа получения и обра- ботки сплавов их внутренняя структура на различных масштабных уровнях существенно изменяется, что приводит к изменению физик о-механических свойств материалов и эксплуатационных характеристик готовых изделий. В связи с вышесказанн",
    "create_time": 1755806701,
    "update_time": 1755806701,
    "_id": "doc-893a7ec9ea15994da5f9bc7b1307b76e"
  },
  "doc-a6744fa6dba495a3e5f00e5146ac694a": {
    "content": "ым для разработки технологических режимов обработки необходимы математические модели, позволяющие анализировать изменяю- щуюся в указанных процессах мезо - и микроструктуру материалов. Одним из основных элементов математических моделей являются консти- тутивные модели (КМ) (или определяющие соотношения (ОС) [1 –2]). Автор считает наиболее перспективным физический подход, который явно описывает физические механизмы необратимых изменений стру ктуры различных уровней и их носители. Важно отметить, что данные КМ основаны на физических зако- нах, которые справедливы для целых классов материалов, делая их суще- ственно более универсальными по сравнению с моделями других подходов. Среди моделей этого ти па наиболее распространены физические теории пла- стичности (ФТП), включающие жесткопластические, упругопластические, вяз- коупругие, вязкопластические и упруговязкопластические модели [3 –6]. Как",
    "create_time": 1755806728,
    "update_time": 1755806728,
    "_id": "doc-a6744fa6dba495a3e5f00e5146ac694a"
  }
}