{
  "doc-4f8755ea327e8bc66f9e934fa19cbbe1": {
    "content": "--- Page 1 ---\n\nМинистерство образования и науки Пермского края Федеральное государственное автономное образовательное учреждение высшего образования «Пермский национальный исследовательский политехнический университет» Федеральное государственное научное учреждение Институт механики сплошных сред УрО РАН Пермский федеральный исследовательский центр УрО РАН МАТЕМАТИЧЕСКОЕ МОДЕЛИРОВАНИЕ В ЕСТЕСТВЕННЫХ НАУКАХ Материалы XXXII I Всероссийской конференции (г. Пермь, 2 –4 октября 2024 г.) Пермь 2024\n\n--- Page 2 ---\n\n2 УДК 517.958: 52/59 М34 Рецензенты: д-р физ. -мат. наук, проф. А.А. Роговой (ИМСС УрО РАН); кафедра общей физики (ПНИПУ ) Математическое моделирование в естест венных науках : матер иалы XXX III Всероссий ской конференции (г. Пермь, 2 –4 октября 2024 г.) / ФГАОУ ВО «Пермский национальный исследовательский политехнический университет». – Пермь, 2024. – 453 с. ISBN 978-5-6049141 -5-1 XXX III Всероссийская конференция «Математическое моделирование в естест венных науках», организованная Пермским национальным исследовательским политехни ческим университетом, посвящена актуальным проблемам математического модели рования в механике, физике, э кологии, биомеханике, технике и технологии по следующим направ лениям: процессы получения новых материалов и прогнозирование их свойств, много уровневые математические модели для описания физико -механических процессов при больших деформациях твердых тел, деформирование и разрушение неоднородных мате риалов, расширенная механика сплошных сред, модели пластичности и сверх пластичности, процессы и системы авиаракетной техники и высоких технологий, модели биомехани ческих процессов . Оргкомитет конференции Председатель: профессор П.В. Трусов (ПНИПУ). Ученый секретарь: ассистент Н.В. Котельникова (ПНИПУ). Члены оргкомитета: профессор Р.В. Бульбович, профессор В.Э. Вильдеман, профессор А.И. Швейкин, доцент В.Н. Ашихмин, доцент Ю.В. Баяндин, доцент П.С. Волегов, доцент Н.С. Кондратьев, доцент Е.С. Макаревич, доцент Н.Д. Няшина, доцент Т.В. Останина, доцент Э.Р. Шарифуллина, н.с. Д.С. Грибов, н.с. К.В. Остапович, м.н.с. К.А. Курмоярцева, м.н.с. А.Н. Поседерцев, м.н.с. А.С.Соколов (ПНИПУ). Научный программный комитет конференции Сопредседатели: академик РАН В.П. Матвеенко, член -корреспондент РАН Е.В. Ломакин, профессор П.В. Трусов . Академик РАН А.А. Барях (ГИ УнЦ РАН), академик РАН И.Г. Горячева (ИПМех РАН), ака- демик РАН Н.В. За йцева (ФНЦ МПТ УРЗН), член -корреспондент РАН А.М. Кривцов (СПбПУ), член -корреспондент РАН О.А. Плехов, профессор О.Б. Наймарк, профессор Р.А. Степанов, про- фессор И.Н. Шардаков (ИМСС УрО РАН), профессор В.И. Астафьев (СамГУ), профессор А.В. Вахрушев (ИМехУрО РАН), профессор А.Е. Волков (СПбГУ), профессор М.П. Кащенко (УГЛТУ), профессор А.Г. Князева (ИФПМ СО РАН), профессор С.А. Лурье (ВЦ РАН), профессор Е.А. Митюшов (УПИ –УГТУ), профессор С.В. Панин (ИФПМ СО РАН), профессор В.В. Стружа- нов (ИМашУрО РАН), профессор А.Б. Фре йдин (ИПМаш РАН), с.н.с. К.Б. Устинов (ИПМех РАН). Оргкомитет конференции считает своим долгом поблагодарить руководителей и коллек- тивы следующих организаций, оказавших поддержку конференции: Министерство образования и науки Пермского края Пермский национальный исследовательский политехнический университет Институт механики сплошных сред УрО РАН Пермский федеральный исследовательский центр УрО РАН УДК 517.958: 52/59 ISBN 978-5-6049141 -5-1 © ПНИПУ, 2024 М34\n\n--- Page 3 ---\n\n5 В.В. Глаголев, Л.В. Глаголев, А.И. Лутхов К нахождению J-интеграла для трещиноподобного дефекта твердого тела в виде физического разреза в конечно -элементном представлении ................... 107 П.А. Гладких Вариант решения проблемы неопределенности в моделях типа Тейлора – Бишопа – Хилла с помощью итерационного подхода ....................... 111 А.Е. Глебова, И.Е. Корозникова, Д.В. Александров Зарождение и рост кристаллов в метастабильном растворе с учетом двухступенчатого механизма ................................ ................................ .. 116 А.А. Гошкодер Моделирование эволюции субзеренной структуры в рамках многоуровнего подхода для описания неупругого деформирования металлов и сплавов ......... 120 Р.П. Давлятшин, В.А. Ершов, Д.Н. Трушников Моделирование с применением беcсеточных методов влияния вибрационных воздействий на процесс проволочной наплавки ................................ ................... 124 Д.А. Долгих, М.А. Ташкинов Численное исследование процессов многомасштабного накопления повреждений и разрушения аддитивно изготовленных полимерных конструкций, армированных углеволоконными препрегами ............................. 128 Д.С. Дудин, И.Э. Келлер Модель эволюции фронта коррозии жаропрочного сплава в серосодержащей среде с учетом напряжений ................................ .................... 131 Е.С. Емельянова, М.А. Писарев Микромеханическая модель деформационного поведения технически чистого титана при одноосном и циклическом нагружении ................................ ............. 135 О.А. Ермоленко, Е.В. Глушков, Н.В. Глушкова Резонансный метод контроля характеристик костной ткани, подверженной остеопорозу ................................ ................................ ................................ ............... 140 В.И. Ерофеев, Е.Е. Лисенкова, И.С. Царев Гаситель поперечных колебаний струны, лежащей на упругом основании ..... 144 Р.А. Загитов, О.В. Маракуева, С.Д. Сальников, Н.В. Шуваев Методика расчет а начальных параметров течения в многоступенчатых турбомашинах в программном комплексе Turbor &D ................................ .......... 149 А.В. Земсков, В.М. Яганов Модель нестационарных термомеханодиффузионных колебаний балки Тимошенко на упругом основании ................................ ................................ ........ 152 Е.А. Иванов, А.В. Зайцев Комплект функциональных накладок на протезно -ортопедическое устройство для компенсации недостающего естественного объема голени человека ......... 156\n\n--- Page 4 ---\n\n111 ВАРИАНТ РЕШЕНИЯ ПРОБЛЕМЫ НЕОПРЕДЕЛЕННОСТИ В МОДЕЛЯХ ТИПА ТЕЙЛОРА – БИШОПА – ХИЛЛА С ПОМОЩЬЮ ИТЕРАЦИОННОГО ПОДХОДА П.А. Гладких Пермский национальный исследовательский политехнический университет, г. Пермь, Российская Федерация, gladkikh .p@yandex .ru Рассматривается проблема неопределенности выбора активных си- стем и вычислении скоростей сдвигов по системам скольжения в моде- лях типа Тейлора – Бишопа – Хилла, описаны часто применяемые для исключения данной неопределенности подходы. Предлагается новый итерационный подход для исключения неопределенности и некоторые результаты его проверки для частного случая. Ключевые слова: конститутивные модели, физически -ориенти- рованные модели типа Тейлора – Бишопа –Хилла, упругопластическая модель Линя, влияние неопределенности выбора активных систем скольжения. Большинство деталей из сплавов производятся с помощью термомеха- нических методов обработки. В зависимости от способа получения и обра- ботки сплавов их внутренняя структура на различных масштабных уровнях существенно изменяется, что приводит к изменению физик о-механических свойств материалов и эксплуатационных характеристик готовых изделий. В связи с вышесказанным для разработки технологических режимов обработки необходимы математические модели, позволяющие анализировать изменяю- щуюся в указанных процессах мезо - и микроструктуру материалов. Одним из основных элементов математических моделей являются консти- тутивные модели (КМ) (или определяющие соотношения (ОС) [1 –2]). Автор считает наиболее перспективным физический подход, который явно описывает физические механизмы необратимых изменений стру ктуры различных уровней и их носители. Важно отметить, что данные КМ основаны на физических зако- нах, которые справедливы для целых классов материалов, делая их суще- ственно более универсальными по сравнению с моделями других подходов. Среди моделей этого ти па наиболее распространены физические теории пла- стичности (ФТП), включающие жесткопластические, упругопластические, вяз- коупругие, вязкопластические и упруговязкопластические модели [3 –6]. Как\n\n--- Page 5 ---\n\n112 правило, модели ФТП являются многоуровневыми и классифицируются на ос- нове организации связей элементов соседних уровней на самосогласованные, прямые и статистические [7 –14]. Самосогласованные и прямые модели требуют значительных вычисли- тельных ресурсов, поэтому наиболее распространенными в настоящее время яв- ляются статистические. Особый интерес представляют статистические упруго- пластические модели, поскольку они позволяют пров одить расчеты с более крупными временными шагами по сравнению с упруговязкопластическими мо- делями [15]. Большинство из них берут начало от моделей типа Тейлора – Би- шопа – Хилла (ТБХ) [16 –18]. Однако стоит отметить существующую для этих моделей проблему нео пределенности выбора наборов активных систем сколь- жения (СС) в металлах и сплавах. Указанная неопределенность связана с тем, что количество линейно -независимых уравнений в упругопластических моде- лях не может быть больше пяти. Согласно закону Шмида, активны е СС – это системы, в которых касательные напряжения достигают критических значений. Иными словами, для этого изображающая точка в пространстве напряжений (ИТН) должна находиться на поверхности (грани, ребре или вершине) текуче- сти. С другой стороны, чтобы можно было реализовать произвольную пласти- ческую (изохорическую) деформацию, необходимо активировать как минимум пять систем скольжения. Поверхность (многогранник) текучести для известных кристаллов обычно имеет вершины порядка выше пятого (например, начал ь- ный многогранник текучести для гранецентрированных кубических кристаллов имеет вершины шестого и восьмого порядка). Нахождение в такой вершине ИТН соответствует активации более чем 5 СС, при этом все эти системы равно- правны с точки зрения выполнения крите рия Шмида. Как ранее было показано в работах [19 –20], неопределенность оказывает значимое влияние на результаты моделирования, из -за чего становится акту- альной задача разработки методов исключения неопределенности. Цель работы – изучение созданных ранее другими авторами методов ре- шения неопределенности и разработка нового итерационного подхода для ис- ключения неопределенности Для достижения поставленной цели был проведен обзор работ других исследователей, был разработан алгоритм двухуровневой статистической упругопластической модели Линя, включающей описание процессов упруго- пластического деформирования на макро - и мезоуровне, а также был разра- ботан итерационный метод исключения неопределенности, который также был проверен на частном случае нагружения монокристалла.\n\n--- Page 6 ---\n\n113 Новая итерационная схема основана на разделении активных систем скольжения на два непересекающихся подмножества D, U. Итерационно до достижения сходимости переопределяется разделение активных систем скольжения на множества D, U, после чего для каждого подмножества от- дельно определяются скорости сдвигов через разрешения соответствующих систем линейных уравнений. Для множества D используется система уравне- ний модели Линя, для множества U – кососимметричное проецирование (с использованием соответствующего диад ного базиса систем скольжения) от- несенной к множеству U составляющей неупругой несимметричной меры скорости деформации. Сходимость итерационной схемы показывается на частном случае нагружения монокристалла, при котором скорости сдвигов по восьми систе- мам скольжения оказываются равными. Исследование выполнено при финансовой поддержке Министерства науки и высшего образования Российской Федерации в рамках реализации националь- ного проекта «Наука и университеты» (в рамках выполнения государствен- ного задания в лаборатории многоуровневого модел ирования конструкционных и функциональных материалов, проект № FSNM -2024 -0002). Список литературы 1. Трусов П.В., Швейкин А.И. Теория определяющих соотношений: учеб. пособие. Ч.II. Теория пластичности. – Пермь: Изд -во Перм. гос. техн. ун-та, 2008. – 243 с. 2. Трусов П.В., Швейкин А.И. Теория пластичности. – Пермь: Изд -во Перм. национ. исслед. политехн. ун -та, 2011. – 419 с. 3. Horstemeyer M.F., Potirniche G.P., Marin E.B. Crystal plasticity / S. Yip; Handbook of Materials Modeling. – Springer: Netherlands, 2005. – Р. 1133–1149. 4. Overview of constitutive laws, kinematics, homogenization and multiscale methods in crystal plasticity finite -element modeling: Theory, experiments, appli- cations / F. Roters, P. Eisenlohr, L. Hantcherli [et al.] // Acta Materialia. – 2010. – Vol. 58. – Р. 1152–1211. – DOI: 10.1016/ j.actamat.2009.10.058 5. Трусов П.В., Волегов П.С., Кондратьев Н.С. Физические теории пла- стичности. – Пермь: Изд -во Перм. национ. исслед. политехн. ун -та, 2013. – 244 с.\n\n--- Page 7 ---\n\n114 6. Трусов П.В., Швейкин А.И. Многоуровневые модели моно - и поли- кристаллических материалов: теория, алгоритмы, примеры применения. – Новосибирск: Изд -во СО РАН, 2019. – 605 с. – DOI: 10.15372/ MULTILEVEL 2019 TPV 7. Lebensohn R.A., Tomé C.N., Ponte Castañeda P. Self -consistent modelling of the me -chanical behaviour of viscoplastic polycrystals incorporating intragranular field fluctuations // Philosophical Magazine. – 2007. – Vol. 87, no. 28. – Р. 4287–4322. – DOI: 10.1080/14786430701432619 8. Horstemeyer M.F. Multiscale modeling: A review / J. Leszczynski and M.K. Shukla (eds.); Practical Aspects of Computational Chemistry. – Springer Science + Business Media B.V. – 2009. – Р. 87–135. – DOI: 10.1007/978 -90-481- 2687 -3_4 9. McDowell D.L. A perspective on trends in multiscale plasticity // Int. J. Plasticity. – 2010. – Vol. 26. – Р. 1280–1309. – DOI: 10.1016/j.ijplas.2010. 02.008 10. A finite strain elastic –viscoplastic self -consistent model for polycrystalline materials / H. Wang, P.D. Wu, C.N. Tome, Y. Huang // J. Mech. and Phys. Solids. – 2010. – Vol. 58 – Р. 594–612. – DOI: 10.1016/ j.jmps.2010.01.004 11. Roters F. Advanced material models for the crystal plasticity finite element method: Development of a general CPFEM framework. – RWTH Aachen: Aachen, 2011. – 226 р. 12. Трусов П.В., Швейкин А.И. Многоуровневые физические модели моно - и поликристаллов. Статистические модели // Физическая мезомеханика. – 2011. – Т. 14, № 4. – С. 17–28. 13. Трусов П.В., Швейкин А.И. Многоуровневые физические модели моно - и поликристаллов. Прямые модели // Физическая мезомеханика . – 2011. – Т. 14, № 5. – С. 5–30. 14. Watanabe I., Setoyama D. Multiscale characterization of a polycrystalline aggregate subjected to severe plastic deformation with the finite element method // Materials Transactions. Special Issue on Advanced Materials Science in Bulk Nanostructured Met als III. – 2016. – P. 1–7. – DOI: 10.2320/matertrans 15. Линь Т.Г. Физическая теория пластичности // Проблемы теории пластичности. Сер . Новое в зарубежной механике . – 1976. – № 7. – С. 7–68. 16. Taylor G.I. Plastic strain in metals // J. Inst. Metals. – 1938. – Vol. 62. – P. 307–324.\n\n--- Page 8 ---\n\n115 17. Bishop J.F., Hill R. A theory of the plastic distortion of a polycristalline aggregate under combined stresses // Phil. Mag. Ser. 7. – 1951. – Vol. 42, no. 327. – P. 414–427. – DOI: 10.1080/14786445108561065 18. Bishop J.F.W., Hill R. A theoretical derivation of the plastic properties of a polycrystalline face – centered metal // Phil. Mag. Ser. 7. – 1951. – Vol. 42, no. 334. – P. 1298–1307. – DOI: 10.1080/ 14786444108561385 19. Grain reorientation during the plastic deformation of f.c.c. metals / B. Bacroix, J.J. Jonas, F. Montheillet, A. Skalli // Acta Metall. – 1986. – Vol. 34, iss. 5. – P. 937–950. – DOI: 10.1016/0001 -6160(86)90067 -2 20. Гладких П.А., Трусов П.В. Влияние выбора активных систем скольжения в двухуровневых упругопластических моделях типа Тейлора – Бишопа – Хилла на отклик поликристаллических материалов // Прикладная математика и вопросы управления. – 2023. – № 3. – С. 22–38. – DOI 10.15593/2499 -9873/2023.3.02\n\n--- Page 9 ---\n\n453 Научное издание МАТЕМАТИЧЕСКОЕ МОДЕЛИРОВАНИЕ В ЕСТЕСТВЕННЫХ НАУКАХ Материалы XXXIII Всероссийской конференции (г. Пермь, 2 –4 октября 2024 г.) Подписано в печать 19.09.2024. Формат 60×90/16. Усл. печ. л. 28,31. Тираж 45 экз. Заказ № 78. Отпечатано в типографии ИП Серегина О.Н. Адрес: 614107, г. Пермь, ул. Металлистов, д. 21, кв. 174",
    "create_time": 1755804306,
    "update_time": 1755804306,
    "_id": "doc-4f8755ea327e8bc66f9e934fa19cbbe1"
  }
}